    {      
        "Comapny Name": {
            "type": "Open Ended",
            "name": "Company Name",
            "message": "Please parse the company name"
        },
        "Report Type":{
            "type": "Close Ended",
            "name": "Report Type",
            "message": "Please select the report type, please just return the Index of the category",
            "choices": {
            "1. Annual Report": "A report published by a company each year to provide information about its financial performance and prospects.",
            "2. CSR Report": "A report published by a company to communicate its social and environmental performance.",
            "3. Appendix": "An additional section of the report that provides more detailed information on a specific topic.",
            "4. Others": "Any other type of report."
            }
        },
        "Report date": {
            "type": "Open Ended",
            "name": "Report date",
            "message": "Please parse the report date, with a fixed format of YYYY-MM-DD"
        },
        "Company Category": {
            "type": "Close Ended",
            "name": "Company Category",
            "message": "Please select the company category, please just return the Index of the category",
            "choices": {
            "Manufacturing": {
                "1. High Emission": "Companies with significant carbon emissions, typically large-scale manufacturers in sectors like chemicals, steel, cement, and heavy machinery.",
                "2. Medium Emission": "Companies with moderate carbon emissions, such as those in automotive manufacturing, electronics, and packaging industries.",
                "3. Low Emission": "Companies with lower carbon emissions, often found in sectors like textiles, apparel, and small-scale manufacturing."
            },
            "4. Service": "Companies providing services rather than producing physical goods.",
            "5. Others": "Companies that do not fit into the Manufacturing or Service categories."
            }
        },
        "Multi choice quesitons": {
            "Importance of climate risk disclosure": "Measures how important investors consider reporting by portfolio firms on climate risks compared to reporting on financial information. The variable ranges between one and five, with one indicating that climate risk reporting is 'much less important' and five indicating that it is 'much more important.'",
            "Demand more disclosure": "Equals one if a respondent 'strongly agrees' that investors should demand that portfolio firms disclose their exposure to climate risk, and zero otherwise. In the underlying questions, respondents were asked to indicate their agreement with the statements on a scale of one ('strongly disagree') through five ('strongly agree').",
            "Quant. information imprecise": "Equals one if a respondent 'strongly agrees' that firm-level quantitative information on climate risk is not sufficiently precise, and zero otherwise. In the underlying questions, respondents were asked to indicate their agreement with the statements on a scale of one ('strongly disagree') through five ('strongly agree').",
            "Management discussions imprecise": "Equals one if a respondent 'strongly agrees' that management discussions on climate risk are not sufficiently precise, and zero otherwise. In the underlying questions, respondents were asked to indicate their agreement with the statements on a scale of one ('strongly disagree') through five ('strongly agree').",
            "TCFD engagement": "Equals one if a respondent engages or plans to engage portfolio companies to report according to the recommendations of the Task Force on Climate-related Financial Disclosures, and zero otherwise.",
            "Carbon footprint disclosure": "Equals one if a respondent discloses or plans to disclose the overall carbon footprint of the portfolio, and zero otherwise.",
            "Climate risk ranking": "Outcome of a ranking of the importance of climate risks relative to other investment risks. The variable ranges from one (if they are considered the least important risk) to six (if climate risks are considered the most important risk).",
            "Climate risk financial materiality": "Averages the responses to three questions about the financial materiality of regulatory, physical, and technological climate risk. Each of these three variables can range between one (not at all important) and five (very important).",
            "Fiduciary duty institution": "Equals one if a respondent strongly agrees to the statement that incorporating climate risks in the investment process 'is a legal obligation/fiduciary duty that we have to consider,' and zero otherwise.",
            "HQ country norms": "Captures the importance of environmental issues in the country in which an institutional investor is headquartered. The data are from Dyck et al. (2019), who construct the variable based on the Environmental Performance Index obtained from the Yale Center for Environmental Law (Yale University) and the Center for International Earth Science Information Network (Columbia University) for 2004. Larger numbers reflect a stronger common belief in the importance of environmental issues.",
            "Very large institution": "Equals one if the size of an institutional investor is more than $100 billion, and zero otherwise.",
            "ESG portfolio share Medium-term horizon": "Percentage of the institution's portfolio that incorporates ESG issues. Equals one if the indicated typical holding period of an institutional investor is between 6 months and 2 years, and zero otherwise.",
            "Long-term horizon": "Equals one if the indicated holding period of an institutional investor is above 2 years, and zero otherwise.",
            "Scope 1 disclosure": "Equals one if a firm discloses Scope 1 carbon emissions to CDP in a year, and zero otherwise.",
            "Climate risk disclosure": "Follows the definition in Flammer, Toffel, and Viswanathan (2021) and captures disclosure to CDP on up to three types of climate risks (regulatory, physical, or other climate risks) in a year. It takes the value of zero if a firm does not disclose climate risks to CDP in a year, one if it discloses information on one type of climate risks, two if it discloses information on two types of climate risks, and three if it discloses information on all three types of climate risks. This variable is available for the years 2011 to 2016 as CDP did not include this question in 2010 and changed the question design from 2017 onward such that the responses are not comparable anymore for these years.",
            "Climate disclosure score": "Measures how comprehensive a firm's climate risk disclosure is to CDP by counting the fraction of questions that were answered in the CDP survey in a year. This variable is only available between 2010 and 2015 as the score was replaced by CDP in 2016 with an alternative measure that mixes disclosure and climate performance. The measure varies between 0 and 100, and higher numbers indicate better climate risk disclosure.",
            "10-K Climate risk disclosure": "Follows Matsumura, Prakash, and Vera-Muñoz (2022) and equals one if a 10-K contains the climate change words 'carbon,' 'climate change,' 'emissions,' 'greenhouse,' 'GHG,' 'hurricanes,' 'renewable energy,' and 'extreme weather' in a year, and zero otherwise. Only available for U.S. firms.",
            "Stewardship code IO": "Fraction of outstanding shares owned by institutional investors that are subject to stewardship codes in their home countries in a year. Winsorized at 1%.",
            "High-norms IO": "Fraction of outstanding shares owned by institutional investors from high-norms countries (as defined by Dyck et al. 2019) in a year. An institutional investor's country is in the high-norms group if its Environmental Performance Index (EPI) is higher than the median in a year. Winsorized at 1%.",
            "Universal owner IO": "Fraction of outstanding shares owned by institutional investors that are classified as universal owners in a year. We classify as universal owners those institutional investors whose number of stocks in the portfolios is ranked in the top 1% across all institutions in a year (calculated at the parent level). The number of observations for this variable is lower than that for the other two ownership measures as we miss parent data for the last sample year. Winsorized at 1%.",
            "Nonstewardship code IO": "Fraction of outstanding shares owned by institutional investors that are not subject to stewardship codes in their home countries in a year. Winsorized at 1%.",
            "Low-norms IO": "Fraction of outstanding shares owned by institutional investors from low-norms countries (as defined by Dyck et al. 2019) in a year. An institutional investor's country is in the low-norms group if its Environmental Performance Index (EPI) is lower than the median in a year. Winsorized at 1%.",
            "Nonuniversal owner IO": "Fraction of outstanding shares owned by institutional investors that are not classified as universal owners in a year. Winsorized at 1%.",
            "High-competition firm": "Equals one if a firm operates in a very competitive industry based on the text-based HHI measure developed by Hoberg and Phillips (2016), and zero otherwise. A firm operates in a very competitive industry if its HHI is below the sample median in a year. Only available for U.S. firms.",
            "High-emission industry": "Equals one if a firm operates in an SIC2 industry that is in the top-20 across SIC2 industries based on Scope 1 emissions, and zero otherwise.",
            "Assets": "Total assets (Worldscope data item WC02999) at the end of the year. Winsorized at the 1% level.",
            "Dividends/net income": "Dividends (Worldscope data item WC04551) at the end of the year, divided by net income/loss at the end of the year (Worldscope data item WC01706). Winsorized at the 1% level.",
            "Debt/assets": "Sum of the book value of long-term debt (Worldscope data item WC03251) and the book value of current liabilities (WC03101) at the end of the year, divided by total assets at the end of the year (Worldscope data item WC02999). Winsorized at 1%.",
            "EBIT/assets": "Earnings before interest and taxes (Worldscope data item WC18191) at the end of the year, divided by total assets at the end of the year (Worldscope data item WC02999). Winsorized at 1%.",
            "CapEx/assets": "Capital expenditures at the end of the year (Worldscope data item WC04601), divided by total assets at the end of the year (Worldscope data item WC02999). Winsorized at 1%.",
            "Book-to-market ratio": "Difference between common equity (Worldscope data item WC03501) and preferred stock capital (WC03451) at the end of the year, divided by the equity market value (MV) at the end of the year. Winsorized at 1%.",
            "Forecast occurrence": "Equals one if a firm issues at least one voluntary earnings forecast in a year, and zero otherwise.",
            "Post-Article 173 C. French Article 173 Analysis": "Equals one for the years of 2016 and afterward, and zero otherwise.",
            "High French IO": "Equals one if the fraction of outstanding shares owned by French institutional investors is above the median of a year, and zero otherwise.",
            "French IO": "Continuous measure of institutional ownership by French institutions.",
            "High French IO pre-Article 173": "Equals one if the average fraction of outstanding shares owned by French institutional investors in the years before 2016 is above the median, and zero otherwise.",
            "French IO pre- to post-Article 173": "Average value of the fraction of outstanding shares owned by French institutional investors for the years 2016 and afterward minus the same average value for the years before 2016.",
            "Scope 1 disclosure pre-Article 173": "Average value of Scope 1 disclosure for the years before 2016.",
            "Climate risk disclosure pre-Article 173": "Average value of Climate risk disclosure for the years before 2016.",
            "French firm": "Equals one if a firm is from France, and zero otherwise.",
        },
        "Engagement and Strategy": {
            "The CEO/chairperson articulates the organization's views on the issue of climate change in annual reports or CSR reports": "Equals one if the CEO/chairperson articulates the organization's views on the issue of climate change in annual reports or CSR reports, and zero otherwise.",
            "Quantitative carbon emission information is disclosed in executive's reports." : "Equals one if quantitative carbon emission information is disclosed in executive's reports, and zero otherwise.",
            "Carbon emissions issue is under the supervision of Board or executive management level." : "Equals one if the carbon emissions issue is under the supervision of Board or executive management level, and zero otherwise.",
            "Firm discloses its general knowledge of climate change and/or carbon emission abatement but without any target or result related information." : "Equals one if the firm discloses its general knowledge of climate change and/or carbon emission abatement but without any target or result related information, and zero otherwise.",
            "Firm implements or plans to implement any specific carbon management schemes" : "Equals one if the firm implements or plans to implement any specific carbon management schemes, and zero otherwise.",
            "Firm has a quantitative target for its future carbon emission reduction." : "Equals one if the firm has a quantitative target for its future carbon emission reduction, and zero otherwise.",
        },
        "Measurement and performance": {
            "Firm discloses the methodology it employed to measure or calculate its carbon emissions.": "Equals one if the firm discloses the methodology it employed to measure or calculate its carbon emissions, and zero otherwise.",
            "Firm measures its carbon emissions in compliance with any carbon footprint measurement standard." : "Equals one if the firm measures its carbon emissions in compliance with any carbon footprint measurement standard, and zero otherwise.",
            "Firm discloses the consolidation approach for its carbon emissions measure and/or any changes during the reporting period." : "Equals one if the firm discloses the consolidation approach for its carbon emissions measure and/or any changes during the reporting period, and zero otherwise.",
            "Firm discloses its carbon operational/ inventory boundary." : "Equals one if the firm discloses its carbon operational/ inventory boundary, and zero otherwise.",
            "Firm discloses its baseline year to measure and/or benchmark its carbon emissions." : "Equals one if the firm discloses its baseline year to measure and/or benchmark its carbon emissions, and zero otherwise.",
            "Firm discloses the quantity of its direct carbon emissions (scope 1 emission)." : "Equals one if the firm discloses the quantity of its direct carbon emissions (scope 1 emission), and zero otherwise.",
            "Firm quantitatively compares its direct carbon emissions with those of either previous year (s) or baseline year." : "Equals one if the firm quantitatively compares its direct carbon emissions with those of either previous year (s) or baseline year, and zero otherwise.",
            "Firm discloses the quantity of its indirect carbon emissions from purchasing energy (scope 2 emissions)." : "Equals one if the firm discloses the quantity of its indirect carbon emissions from purchasing energy (scope 2 emissions), and zero otherwise.",
            "Firm quantitatively compares its indirect carbon emissions from purchasing energy with those of either previous year (s) or baseline year." : "Equals one if the firm quantitatively compares its indirect carbon emissions from purchasing energy with those of either previous year (s) or baseline year, and zero otherwise.",
            "Firm discloses its scope 1 and/or 2 emission intensity." : "Equals one if the firm discloses its scope 1 and/or 2 emission intensity, and zero otherwise.",
            "Firm discloses the quantity of its other indirect carbon emissions (scope 3 emissions)." : "Equals one if the firm discloses the quantity of its other indirect carbon emissions (scope 3 emissions), and zero otherwise.",
            "Firm quantitatively compares its other indirect carbon emissions from purchasing energy with those of either previous year (s) or baseline year." : "Equals one if the firm quantitatively compares its other indirect carbon emissions from purchasing energy with those of either previous year (s) or baseline year, and zero otherwise.",
            "Firm discloses its scope 3 emissions intensity." : "Equals one if the firm discloses its scope 3 emissions intensity, and zero otherwise.",
            "Firm breaks down its carbon emissions, e.g., by business activities, by products or services." : "Equals one if the firm breaks down its carbon emissions, e.g., by business activities, by products or services, and zero otherwise.",
            "Firm explains its carbon emission performance and/or any significant changes in its carbon emissions performance." : "Equals one if the firm explains its carbon emission performance and/or any significant changes in its carbon emissions performance, and zero otherwise.",
            "Firm discloses the financial implications of its carbon emissions." : "Equals one if the firm discloses the financial implications of its carbon emissions, and zero otherwise.",
            "The carbon disclosures are independently verified by a third party." : "Equals one if the carbon disclosures are independently verified by a third party, and zero otherwise.",
            "The third party gives unqualified opinion of the disclosed carbon information." : "Equals one if the third party gives unqualified opinion of the disclosed carbon information, and zero otherwise.",
        },
        "Risk and opportunity": {
            "Firm recognises any carbon related regulatory or compliance risks." : "Equals one if the firm recognises any carbon related regulatory or compliance risks, and zero otherwise.",
            "Firm recognises carbon price risks." : "Equals one if the firm recognises carbon price risks, and zero otherwise.",
            "Firm discloses its strategies to manage its carbon related risks." : "Equals one if the firm discloses its strategies to manage its carbon related risks, and zero otherwise.",
            "Firm discloses any other carbon-related risks." : "Equals one if the firm discloses any other carbon-related risks, and zero otherwise.",
            "Firm discloses its energy efficiency and/or renewable energy policy to reduce its carbon emissions." : "Equals one if the firm discloses its energy efficiency and/or renewable energy policy to reduce its carbon emissions, and zero otherwise.",
            "Firm discloses the amount of investments in energy efficiency and/or renewable energy." : "Equals one if the firm discloses the amount of investments in energy efficiency and/or renewable energy, and zero otherwise.",
            "Firm discloses its lower-carbon technology policy." : "Equals one if the firm discloses its lower-carbon technology policy, and zero otherwise.",
            "Firm discloses the amount of investments in lower-carbon technology." : "Equals one if the firm discloses the amount of investments in lower-carbon technology, and zero otherwise.",
            "Firm improves in its business process to reduce carbon emissions." : "Equals one if the firm improves in its business process to reduce carbon emissions, and zero otherwise.",
            "Firm requires its employees and/or its value chain organizations to reduce carbon emissions." : "Equals one if the firm requires its employees and/or its value chain organizations to reduce carbon emissions, and zero otherwise.",
            "Firm works with any other organizations towards carbon abatement." : "Equals one if the firm works with any other organizations towards carbon abatement, and zero otherwise.",
            "Firm provides financial support to other organizations on carbon abatement activities." : "Equals one if the firm provides financial support to other organizations on carbon abatement activities, and zero otherwise.",
            "Firm discloses the amount of financial support to other organizations on carbon abatement activities." : "Equals one if the firm discloses the amount of financial support to other organizations on carbon abatement activities, and zero otherwise.",
            "Firm discloses any other carbon related opportunities." : "Equals one if the firm discloses any other carbon related opportunities, and zero otherwise.",
        },
        "Quantitative data analysis":{
            "Type": "Open Ended",
            "Message": "Please provide the quantitative data analysis for the input report. You are an expert at reading climate risk disclosures. You have been asked to review the climate risk disclosures of input report.",
            "Quantitiavive Data Found": "Please report the data found in the input report. Give their name in comma separated format.",
            "Data": "For every data you found, please provide all available data from the input report. Put all numbers you found in a list in your response, which is categorized by the \"data name\"."
        }
    }